[
  {
    "id": 1,
    "tag": "favomedic",
    "title": "Favomedic Frontend",
    "description": "A web application for Favomedic, during my internship at Jarpis.",
    "about": "During my internship at Jarpis, I had the opportunity to contribute to the development of the front-end for the impressive web application, Favomedic. Within this role, my primary focus was on creating aesthetically pleasing and well-designed components. As I grew more proficient, my responsibilities expanded to encompass writing and implementing the application's core logic.",
    "used": [
      "Angular",
      "TypeScript",
      "Tailwind CSS",
      "ng-zorro-antd"
    ],
    "other": "This is the project where I learned to work with the Angular framework and TypeScript. This also gave me a look in how web-apps are build, I have learned a lot from this project.",
    "images": [
      {
        "name": "Image 1",
        "description": "This is the first image",
        "url": "https://i0.wp.com/www.printmag.com/wp-content/uploads/2021/02/4cbe8d_f1ed2800a49649848102c68fc5a66e53mv2.gif?fit=476%2C280&ssl=1"
      }
    ]
  },
  {
    "id": 2,
    "tag": "js-dice",
    "title": "JS Dice",
    "description": "A simple dice game made with JavaScript. Object-oriented programming",
    "about": "This is a simple dice game made with JavaScript. The goal of the project was to learn OOP in JavaScript. The game is made with a class for the dice and a class for the game.",
    "used": [
      "JavaScript",
      "Object-Oriented Programming",
      "HTML"
    ]
  },
  {
    "id": 3,
    "tag": "Projects Portfolio",
    "title": "Projects Portfolio",
    "description": "A portfolio website to showcase my projects.",
    "about": "This is the website you are currently on. I made this website to showcase my projects. The structure of the project has 2 core components: The list of projects, and the project page.",
    "used": [
      "Angular",
      "Tailwind CSS",
      "Json"
    ],
    "other": "I coded this project with the idea to get everything from the json file (like an API response). The project link sends an id, and the project page handels all the data.",
    "links": [
      {
        "name": "Github/Toby142/project-portfolio",
        "url": "https://github.com/Toby142/project-portfolio"
      }
    ]
  }
]